Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAllDownstreamOnDutyLoadIds
Get all the descendant on duty Electrical Analytical Load ids of the node.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAnalyticalLoadClassificationData
Gets the electrical analytical load classification data which used to get demand load detail information of the node.
Returns:
The electrical analytical load classification data.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAnalyticalLoadScenariosData
Gets the electrical analytical load scenarios data.
Returns:
The electrical analytical load scenarios data.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAllDownstreamLoadIds
Get all the descendant Electrical Analytical Load ids of the node.
Remarks:
No matter the load is on stand by or not, the load id will be included in the returned load ids set.
Since:
2024

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.CanConnectToUpstreamNode(Autodesk.Revit.DB.ElementId)
Verifies that the current node can connect to the upstream node.
upstreamNodeId:
The upstream node id.
Returns:
True if the current node can connect to the upstream node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.CanDisconnectFromUpstreamNode(Autodesk.Revit.DB.ElementId)
Verifies that the current node can disconnect from the upstream node.
upstreamNodeId:
The upstream node id.
Returns:
True if the current node can disconnect from the upstream node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetDownstreamNodeIds
Gets the downstream node ids.
Remarks:
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B.
Usually one node may have many downstream nodes, but TransferSwitch can only have one downstream node.
Returns:
The array of downstream node ids.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.DisconnectFromUpstreamNode(Autodesk.Revit.DB.ElementId)
Disconnects from upstream node.
upstreamNodeId:
The upstream node id to disconnect from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not an analytical distribution node id.
-or-
The analytical distribution node can not disconnect from the upstream node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.ConnectToUpstreamNode(Autodesk.Revit.DB.ElementId)
Connects to upstream node.
upstreamNodeId:
The upstream node id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not an analytical distribution node id.
-or-
The analytical distribution node is full of downstream nodes.
-or-
The analytical distribution node can not connect to the upstream node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The analytical distribution node is full of upstream nodes.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetUpstreamNodeIds
Gets upstream node ids.
Remarks:
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B.
Usually one node only has one upstream node, but TransferSwitch may have two upstream nodes.
Returns:
The array of upstream node ids.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.GetAnalyticalPropertyData
Gets the electrical analytical node property data, null if not available.
Remarks:
These types have special data:
BusTransferSwitchEquipmentLoad
Returns:
The electrical analytical node property data.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType,System.String)
Creates an electrical analytical node.
document:
The document where the new element will be created.
type:
The type of electrical analytical node to be created.
name:
The name of new electrical analytical node. The actual name may be post-fixed if already exists.
Returns:
The newly created electrical analytical node.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.TotalLoad
The Total Connected Load.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.NodeType
The type of electrical analytical node.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode
Represents an electrical analytical node under the Analytical Power Distribution in the System Browser.
Remarks:
This represents one of any number of types, as specified by the ElectricalAnalyticalNodeType.
Some of those types will have AnalyticalDistributionNodePropertyData while others will not, and if they do have data they can be downcast to a specific subclass of data to be used.
Since:
2023